In [1]:
# Import luigi's full dataset of race data
from learntools.python.luigi_analysis import full_dataset

# Fix me!
def best_items(racers):
    winner_item_counts = {}
    for i in range(len(racers)):
        # The i'th racer dictionary
        racer = racers[i]
        # We're only interested in racers who finished in first
        if racer['finish'] == 1:
            for i in racer['items']:
                # Add one to the count for this item (adding it to the dict if necessary)
                if i not in winner_item_counts:
                    winner_item_counts[i] = 0
                winner_item_counts[i] += 1

        # Data quality issues :/ Print a warning about racers with no name set. We'll take care of it later.
        if racer['name'] is None:
            print("WARNING: Encountered racer with unknown name on iteration {}/{} (racer = {})".format(
                str(i+1), str(len(racers)), racer['name'])
                 )

    return winner_item_counts

# Try analyzing the imported full dataset
best_items(full_dataset)

ModuleNotFoundError: No module named 'learntools'

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [3]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [4]:
frame.head()    #selects only first 5 rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [5]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])      #change the order of columns

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [6]:
newOrder = pd.DataFrame(data, columns=['year', 'state', 'pop'])

In [7]:
newOrder

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [8]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
 index=['one', 'two', 'three', 'four',
 'five', 'six'])

In [13]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [10]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [11]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [12]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

frame2[column] works for any column name, but frame2.column
only works when the column name is a valid Python variable
name.

In [14]:
frame2.debt

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [15]:
frame2['debt']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [16]:
frame2.loc['two']

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [17]:
frame2.debt=16.5

In [18]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [21]:
frame2['debt'] = np.arange(6.)

In [22]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [44]:
frame2['eastern'] = frame2.state == 'ohio'

In [45]:
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   3.0     True
two    2001    ohio  1.7   NaN     True
three  2002    ohio  3.6   1.0     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9   2.0    False
six    2003  Nevada  3.2   NaN    False

In [46]:
del frame2['eastern']

In [47]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   3.0
two    2001    ohio  1.7   NaN
three  2002    ohio  3.6   1.0
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   2.0
six    2003  Nevada  3.2   NaN

In [48]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [49]:
frame3 = pd.DataFrame(pop)

In [50]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [51]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [55]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

AttributeError: 'list' object has no attribute 'astype'

In [54]:
pd.DataFrame(pop)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [56]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
 index=['a', 'c', 'd'],
 columns=['Ohio', 'Texas', 'California'])

In [57]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [58]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [59]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [60]:
states = ['Texas', 'Utah', 'California']

In [61]:
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [3]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [4]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [5]:
obj[2]

2.0

In [6]:
obj['c']

2.0

In [7]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [9]:
obj['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [10]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=['Ohio', 'Colorado', 'Utah', 'New York'],
 columns=['one', 'two', 'three', 'four'])

In [11]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data1 = pd.DataFrame(np.arange(16).reshape(4,4))

In [17]:
data1

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [25]:
data[['four','one']]

          four  one
Ohio         3    0
Colorado     7    4
Utah        11    8
New York    15   12

In [26]:
data[:1]

      one  two  three  four
Ohio    0    1      2     3

In [27]:
data[:3]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [28]:
data[data < 5] = 0

In [29]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [30]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

Here we in loc or iloc we will use row first then columns and row/column no. starts with zero.

In [31]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [32]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [33]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [34]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [37]:
data.iloc[:, :3][data.three > 5]                   #data.iloc[row_number(index no),column_number(index no)][condition]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [38]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [39]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [40]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
index=['a', 'c', 'e', 'f', 'g'])

In [42]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [44]:
s1 + s2     # outer join, adds only which is common in both dataframes

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [45]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
index=['Ohio', 'Texas', 'Colorado'])

In [46]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [47]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [48]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [49]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [50]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
 columns=list('abcd'))

In [51]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
 columns=list('abcde'))

In [52]:
df2.loc[1, 'b'] = np.nan

In [53]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [54]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [55]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [56]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [57]:
df1.reindex(columns=df2.columns, fill_value='null')

     a    b     c     d     e
0  0.0  1.0   2.0   3.0  null
1  4.0  5.0   6.0   7.0  null
2  8.0  9.0  10.0  11.0  null

In [2]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [3]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [4]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [5]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
.....: index=['three', 'one'],
.....: columns=['d', 'a', 'b', 'c'])

In [6]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [7]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [8]:
frame.sort_index(axis = 1)            # axis = 1 = columns

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [9]:
frame.sort_index(axis=0)        # axis = 0 = rows

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [10]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [12]:
obj = pd.Series([4, 7, -3, 0])

In [13]:
obj

0    4
1    7
2   -3
3    0
dtype: int64

In [14]:
obj.sort_index()

0    4
1    7
2   -3
3    0
dtype: int64

In [15]:
obj.sort_values()

2   -3
3    0
0    4
1    7
dtype: int64

In [16]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [18]:
obj.sort_values()             #missing values will be in the last rows

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [19]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [20]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [23]:
frame.sort_values(by = 'a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [25]:
frame.sort_values(by = ['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [26]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [27]:
obj.rank()                 # ????

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [30]:
obj.rank(method = 'first')                  # rank series values in order of their observation

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [31]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [32]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
.....: 'c': [-2, 5, 8, -2.5]})

In [33]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [34]:
frame.rank(axis='columns')                   # ?????

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [35]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [36]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [37]:
obj.index.is_unique

False

In [38]:
obj['a']

a    0
a    1
dtype: int64

In [39]:
obj['c']

4

In [40]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [41]:
df

          0         1         2
a -0.900008  0.124583 -1.085464
a -0.564075  1.902832 -1.705377
b -0.950910  1.458652  0.739573
b -0.012580 -1.109171  1.939106

In [42]:
df.loc['b']

         0         1         2
b -0.95091  1.458652  0.739573
b -0.01258 -1.109171  1.939106

In [43]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
.....: [np.nan, np.nan], [0.75, -1.3]],
.....: index=['a', 'b', 'c', 'd'],
.....: columns=['one', 'two'])

In [44]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [45]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [47]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [48]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [49]:
df.idxmax()

one    b
two    d
dtype: object

In [50]:
df.idxmin()

one    d
two    b
dtype: object

In [51]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [52]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [53]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [54]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [55]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [60]:
import pandas_datareader.data as web

ModuleNotFoundError: No module named 'pandas_datareader'

In [61]:
import pandas_datareader

ModuleNotFoundError: No module named 'pandas_datareader'

In [62]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [63]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [64]:
uniques = obj.unique()

In [65]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [67]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [68]:
pd.value_counts(obj.values, sort=False)

a    3
b    2
d    1
c    3
dtype: int64

In [69]:
mask = obj.isin(['b', 'c'])

In [70]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [71]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [72]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [73]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [74]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [75]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
.....: 'Qu2': [2, 3, 1, 2, 3],
.....: 'Qu3': [1, 5, 2, 4, 4]})

In [76]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [77]:
result = data.apply(pd.value_counts).fillna(0)

In [78]:
result                #Here, the row labels in the result are the distinct values occurring in all of the columns.
                      #The values are the respective counts of these values in each column.

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0